var APP_DATA = {
  "scenes": [
    {
      "id": "0-1-basis",
      "name": "1-BASIS",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        },
        {
          "tileSize": 512,
          "size": 4096
        }
      ],
      "faceSize": 2944,
      "initialViewParameters": {
        "yaw": 2.680705604097813,
        "pitch": 0.0992639434525806,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -0.013418495872265623,
          "pitch": 0.11842592769443883,
          "rotation": 0,
          "target": "1-2-aksu-1-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": 1.8168179429088633,
          "pitch": 0.01665225706154949,
          "rotation": 0,
          "target": "4-3-park-1"
        },
        {
          "yaw": 0.6226909972432004,
          "pitch": -0.06550551961468543,
          "rotation": 0,
          "target": "8-4-zapo-1"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 3.0389971091887436,
          "pitch": 0.03442488985162129,
          "title": "Шымкент",
          "text": "<div>Шымкент — Қазақстанның оңтүстігіндегі ірі қала және табиғи-климаттық жағынан ерекше өңір. Қала маңында таулы аймақтар, өзен аңғарлары мен табиғи қорықтар орналасқан. Бұл аймақтар өңірдің биологиялық әртүрлілігін сақтауда маңызды рөл атқарады.</div>"
        },
        {
          "yaw": -0.0033437742046054098,
          "pitch": -0.011622707044848468,
          "title": "Аксу",
          "text": "Ақсу — Сайрам-Өгем ұлттық паркінің аумағындағы тау өзені. Өзен терең шатқалдар арқылы ағып, аймақтың ерекше табиғи ландшафтын қалыптастырады. Ақсу маңы сирек өсімдіктер мен жануарлардың тіршілік ортасы болып табылады.<br data-start=\"234\" data-end=\"237\">"
        },
        {
          "yaw": 1.8398741608006048,
          "pitch": -0.15116494893389287,
          "title": "Сайрам-Өгем ұлттық паркі",
          "text": "Сайрам-Өгем ұлттық паркі 2006 жылы құрылған және Батыс Тянь-Шань таулы аймағында орналасқан. Бұл парк сирек кездесетін өсімдіктер мен жануарларды қорғау мақсатында ұйымдастырылған. Табиғи ландшафттары ерекше алуан түрлілігімен ерекшеленеді.<br data-start=\"876\" data-end=\"879\">"
        },
        {
          "yaw": 0.7146585874793541,
          "pitch": -0.18730619697190676,
          "title": "<h3 data-start=\"49\" data-end=\"79\"><strong data-start=\"53\" data-end=\"77\">Ақсу-Жабағылы қорығы</strong></h3>\n<p data-start=\"80\" data-end=\"552\"></p>",
          "text": "Ақсу-Жабағылы қорығы — Қазақстандағы ең көне қорық, 1926 жылы құрылған. Ол Батыс Тянь-Шань тауларында орналасқан және ЮНЕСКО-ның биосфералық резерваттар тізіміне енгізілген. Қорық сирек өсімдіктер мен жануарларды қорғауға арналған."
        }
      ]
    },
    {
      "id": "1-2-aksu-1-gigapixel-high-fidelity-v2-2x",
      "name": "2-AKSU-1-gigapixel-high fidelity v2-2x",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": 1.1611906954571047,
        "pitch": 0.0022644932922748495,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": 1.4866605046076984,
          "pitch": -0.06926724325381883,
          "rotation": 0,
          "target": "2-2-aksu-2-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": -1.7192452064025154,
          "pitch": -0.07081372129029262,
          "rotation": 0,
          "target": "0-1-basis"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.14384293044227014,
          "pitch": -0.20459161760402367,
          "title": "Каньон Аксу",
          "text": "Ақсу каньоны — Қазақстандағы ең терең және әсерлі шатқалдардың бірі. Оның биік жартастары мен тік құздары табиғаттың күшін айқын көрсетеді. Каньон аумағы сирек өсімдіктер мен жабайы жануарлар үшін маңызды мекен болып саналады.<br data-start=\"245\" data-end=\"248\">"
        },
        {
          "yaw": -2.743805655494718,
          "pitch": -0.051572867146676415,
          "title": "<strong data-start=\"0\" data-end=\"40\" data-is-only-node=\"\">Каньондағы бұталар мен шағын ағаштар</strong><br data-start=\"40\" data-end=\"43\">",
          "text": "Ақсу каньонында құрғақшылыққа төзімді шағын ағаштар мен бұталар өседі. Олар тасты беткейлерге бейімделіп, терең тамыр жүйесі арқылы ылғалды сақтай алады. Мұндай өсімдіктер топырақты бекітіп, эрозияның алдын алуға көмектеседі."
        }
      ]
    },
    {
      "id": "2-2-aksu-2-gigapixel-high-fidelity-v2-2x",
      "name": "2-AKSU-2-gigapixel-high fidelity v2-2x",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "yaw": 0.09217969859530761,
        "pitch": 0.2523486521403413,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -2.8081866955122976,
          "pitch": -0.05928402221807616,
          "rotation": 0,
          "target": "1-2-aksu-1-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": -0.2876604549522792,
          "pitch": 0.0407673459755884,
          "rotation": 0,
          "target": "3-2-aksu-3"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.10950662908702036,
          "pitch": 0.12934585997015624,
          "title": "<strong data-start=\"35\" data-end=\"69\">Арша мен жабайы бадам ағаштары</strong><br data-start=\"69\" data-end=\"72\"><div><strong data-start=\"35\" data-end=\"69\"><br></strong></div>",
          "text": "Ақсу каньонында арша (Juniperus) мен жабайы бадам сияқты төзімді ағаш түрлері өседі. Бұл өсімдіктер құрғақ климатқа және тасты топыраққа бейімделген. Олар баяу өссе де, ұзақ өмір сүріп, тау экожүйесінің тұрақтылығын сақтауға көмектеседі."
        },
        {
          "yaw": 0.8651555958250263,
          "pitch": -0.12123634837110941,
          "title": "Жер бетіне шыққан тамырлар<div><br></div>",
          "text": "Каньон аймағында кейбір ағаштардың тамырлары жер бетіне көрініп тұрады. Бұл құбылыс топырақтың жұқалығы мен жел және су эрозиясының әсерінен болады. Ашық тамырлар өсімдіктің жартасқа берік бекінуіне және ылғалды тиімді сіңіруіне мүмкіндік береді."
        }
      ]
    },
    {
      "id": "3-2-aksu-3",
      "name": "2-AKSU-3",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "yaw": 1.6315840769655052,
        "pitch": 0.01729805980501986,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -0.14086535133264277,
          "pitch": 0.07585240907259205,
          "rotation": 0,
          "target": "2-2-aksu-2-gigapixel-high-fidelity-v2-2x"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 1.6406034894449828,
          "pitch": -0.023863084085636643,
          "title": "<h3 data-start=\"53\" data-end=\"94\"><strong data-start=\"57\" data-end=\"92\">Ақсу өзенінің бастауы мен ағысы</strong></h3>\n<p data-start=\"95\" data-end=\"570\"></p>",
          "text": "Ақсу өзені бастауын Талас Алатауының мұздықтары мен қарлы шыңдарынан алады. Өзен тау шатқалдары арқылы ағып, кейін Сырдария өзенінің алабына қосылады. Ол аймақтың су жүйесінде маңызды рөл атқарады және табиғи экожүйелерді ылғалмен қамтамасыз етеді."
        }
      ]
    },
    {
      "id": "4-3-park-1",
      "name": "3-PARK-1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": 0.14855868087922453,
        "pitch": -0.08244926116218032,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -2.157875049663499,
          "pitch": -0.18180803828528447,
          "rotation": 0,
          "target": "0-1-basis"
        },
        {
          "yaw": 0.0365807669707241,
          "pitch": -0.12632635919002766,
          "rotation": 0,
          "target": "5-3-park-2"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.7319197743108745,
          "pitch": 0.2592851232405664,
          "title": "<h3 data-start=\"1104\" data-end=\"1127\"><strong data-start=\"1108\" data-end=\"1125\">Таулы экожүйе</strong></h3>\n<p data-start=\"1128\" data-end=\"1524\"></p>",
          "text": "Парк аумағында биік таулар, терең шатқалдар мен альпілік шалғындар бар. Әр биіктік белдеуінде өзіндік өсімдіктер мен жануарлар дүниесі қалыптасқан. Бұл табиғи зоналылық экожүйенің байлығын көрсетеді."
        }
      ]
    },
    {
      "id": "5-3-park-2",
      "name": "3-PARK-2",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 2048,
      "initialViewParameters": {
        "yaw": -1.720802222752944,
        "pitch": 0.1350097558642549,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": 0.0365483944503211,
          "pitch": -0.2382215237632348,
          "rotation": 0,
          "target": "6-3-park-3-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": -2.557392829024355,
          "pitch": 0.07527932929929193,
          "rotation": 0,
          "target": "4-3-park-1"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -1.9343629462067575,
          "pitch": 0.1143615568486176,
          "title": "<h3 data-start=\"1531\" data-end=\"1556\"><strong data-start=\"1535\" data-end=\"1554\">Сирек жануарлар</strong></h3>\n<p data-start=\"1557\" data-end=\"1923\"></p>",
          "text": "Ұлттық парк аумағында қар барысы, арқар және сілеусін сияқты сирек жануарлар кездеседі. Бұл түрлер Қазақстанның Қызыл кітабына енгізілген. Оларды қорғау – парктің басты міндеттерінің бірі."
        }
      ]
    },
    {
      "id": "6-3-park-3-gigapixel-high-fidelity-v2-2x",
      "name": "3-PARK-3-gigapixel-high fidelity v2-2x",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": 1.4400323093590277,
        "pitch": 0.1272081735327113,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": 1.380736657482263,
          "pitch": -0.01393902028782712,
          "rotation": 0,
          "target": "5-3-park-2"
        },
        {
          "yaw": -1.1999322820365208,
          "pitch": -0.3664643363678124,
          "rotation": 0,
          "target": "7-3-park-4"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.14151075761528276,
          "pitch": -0.204971109308012,
          "title": "<h3 data-start=\"1930\" data-end=\"1959\"><strong data-start=\"1934\" data-end=\"1957\">Қызғалдақтар мекені</strong></h3>\n<p data-start=\"1960\" data-end=\"2285\"></p>",
          "text": "Парк аумағында Грейг және Кауфман қызғалдақтары өседі. Бұл гүлдер көктемде тау бөктерін түрлі-түске бояйды. Олар әлемдік маңызы бар сирек өсімдіктер қатарына жатады.<br data-start=\"2125\" data-end=\"2128\">"
        }
      ]
    },
    {
      "id": "7-3-park-4",
      "name": "3-PARK-4",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": 1.004990406648167,
        "pitch": 0.1755484626665229,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -0.44927347158421505,
          "pitch": 0.6714423537883221,
          "rotation": 0,
          "target": "6-3-park-3-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": 2.6020345103153915,
          "pitch": -0.18717375508379952,
          "rotation": 0,
          "target": "12-4-zapo-5-gigapixel-high-fidelity-v2-2x"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.8537245539137466,
          "pitch": 0.15346948353642276,
          "title": "Экологиялық маңызы",
          "text": "Сайрам-Өгем ұлттық паркі – биоалуантүрлілікті сақтайтын маңызды табиғи аймақ. Ол ғылыми зерттеулер мен экологиялық туризм үшін үлкен маңызға ие. Табиғатты қорғау – болашақ ұрпақ алдындағы жауапкершілік."
        },
        {
          "yaw": -3.052666620235801,
          "pitch": -0.21494639579717756,
          "title": "Өзендер мен мұздықтар",
          "text": "Парк аумағында көптеген тау өзендері мен мұздықтар орналасқан. Олар аймақтың су қорын қалыптастырады және төменгі аумақтарды сумен қамтамасыз етеді. Мұздықтар климаттың өзгеруіне өте сезімтал."
        }
      ]
    },
    {
      "id": "8-4-zapo-1",
      "name": "4-ZAPO-1",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 750,
      "initialViewParameters": {
        "yaw": 1.3986532876426665,
        "pitch": 0.15975356558536902,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -1.4910989043005074,
          "pitch": 0.034993440710485046,
          "rotation": 0,
          "target": "0-1-basis"
        },
        {
          "yaw": 1.754076307018705,
          "pitch": -0.07343433421814716,
          "rotation": 0,
          "target": "9-4-zapo-2-gigapixel-high-fidelity-v2-2x"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.4246583047342707,
          "pitch": 0.007727553250109764,
          "title": "Табиғи ландшафттар",
          "text": "Қорық аумағында биік таулар, шатқалдар, альпілік шалғындар мен өзен аңғарлары бар. Әртүрлі биіктік белдеулерінде табиғат бір-бірінен өзгеше болады. Бұл аймақ ерекше геологиялық құрылымымен де танымал."
        },
        {
          "yaw": 2.2112282339863096,
          "pitch": 0.1556046049376345,
          "title": "Құстар әлемі",
          "text": "Ақсу-Жабағылы қорығында бүркіт, сақалтай және ұлар сияқты сирек құстар кездеседі. Аймақ құстардың ұя салуына және көші-қон жолдарына қолайлы. Сондықтан қорық орнитологтар үшін маңызды зерттеу орны болып саналады."
        }
      ]
    },
    {
      "id": "9-4-zapo-2-gigapixel-high-fidelity-v2-2x",
      "name": "4-ZAPO-2-gigapixel-high fidelity v2-2x",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1448,
      "initialViewParameters": {
        "yaw": -1.2807122554411272,
        "pitch": -0.03697726346264041,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": 1.2513320914182735,
          "pitch": 0.010121139497179854,
          "rotation": 0,
          "target": "8-4-zapo-1"
        },
        {
          "yaw": -1.3750802603153325,
          "pitch": -0.24233443658281217,
          "rotation": 0,
          "target": "10-4-zapo-3-gigapixel-high-fidelity-v2-2x"
        }
      ],
      "infoHotspots": [
        {
          "yaw": -0.4425900258531392,
          "pitch": -0.21373007705244618,
          "title": "<h3 data-start=\"1000\" data-end=\"1033\"><strong data-start=\"1004\" data-end=\"1031\">Сирек жануарлар дүниесі</strong></h3>\n<p data-start=\"1034\" data-end=\"1378\"></p>",
          "text": "Қорықта қар барысы, арқар, тау теке және сілеусін мекендейді. Бұл жануарлар Қазақстанның Қызыл кітабына енгізілген. Қорық олардың табиғи мекенін сақтауға мүмкіндік береді."
        }
      ]
    },
    {
      "id": "10-4-zapo-3-gigapixel-high-fidelity-v2-2x",
      "name": "4-ZAPO-3-gigapixel-high fidelity v2-2x",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": -3.0577709932417694,
        "pitch": -0.2822895208411005,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -3.105489293355385,
          "pitch": -0.22436995338011734,
          "rotation": 0,
          "target": "11-4-zapo-4-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": -0.07100267897525114,
          "pitch": -0.019452786800851385,
          "rotation": 0,
          "target": "9-4-zapo-2-gigapixel-high-fidelity-v2-2x"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 2.424162240081711,
          "pitch": -0.29566475895345157,
          "title": "Өсімдіктер дүниесі",
          "text": "Қорық аумағында 1700-ден астам өсімдік түрі өседі. Олардың ішінде Грейг, Кауфман және Регель қызғалдақтары бар. Бұл аймақ жабайы қызғалдақтардың отаны болып саналады."
        }
      ]
    },
    {
      "id": "11-4-zapo-4-gigapixel-high-fidelity-v2-2x",
      "name": "4-ZAPO-4-gigapixel-high fidelity v2-2x",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        },
        {
          "tileSize": 512,
          "size": 2048
        }
      ],
      "faceSize": 1728,
      "initialViewParameters": {
        "yaw": 0.7927857863891496,
        "pitch": -0.09691101123398305,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": -2.3830891865459094,
          "pitch": -0.10977298575997452,
          "rotation": 0,
          "target": "10-4-zapo-3-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": 2.664145552907014,
          "pitch": -0.5118454023567818,
          "rotation": 0,
          "target": "12-4-zapo-5-gigapixel-high-fidelity-v2-2x"
        }
      ],
      "infoHotspots": [
        {
          "yaw": 0.5391757420869308,
          "pitch": 0.18077018806108747,
          "title": "<h3 data-start=\"2172\" data-end=\"2195\"><strong data-start=\"2176\" data-end=\"2193\">Ғылыми маңызы</strong></h3>\n<p data-start=\"2196\" data-end=\"2601\"></p>",
          "text": "Ақсу-Жабағылы қорығы ғылыми зерттеулер үшін өте маңызды аймақ. Мұнда табиғи үдерістер ұзақ уақыт бойы бақылауға алынады. Зерттеулер климат өзгерісі мен биоалуантүрлілік мәселелерін түсінуге көмектеседі."
        },
        {
          "yaw": 1.462582721897629,
          "pitch": -0.05707025261635401,
          "title": "Қорғау және экотуризм",
          "text": "Қорық аумағы қатаң қорғауға алынған. Туризм тек арнайы бағыттар арқылы жүзеге асырылады. Бұл табиғатты сақтауға және адамдардың экологиялық мәдениетін арттыруға көмектеседі."
        }
      ]
    },
    {
      "id": "12-4-zapo-5-gigapixel-high-fidelity-v2-2x",
      "name": "4-ZAPO-5-gigapixel-high fidelity v2-2x",
      "levels": [
        {
          "tileSize": 256,
          "size": 256,
          "fallbackOnly": true
        },
        {
          "tileSize": 512,
          "size": 512
        },
        {
          "tileSize": 512,
          "size": 1024
        }
      ],
      "faceSize": 1024,
      "initialViewParameters": {
        "yaw": -3.0353527294227156,
        "pitch": 0.28727464712841133,
        "fov": 1.3365071038314758
      },
      "linkHotspots": [
        {
          "yaw": 2.2307093445982265,
          "pitch": 0.16986147892179204,
          "rotation": 0,
          "target": "7-3-park-4"
        },
        {
          "yaw": -2.257385963237395,
          "pitch": 0.10882525151237132,
          "rotation": 0,
          "target": "11-4-zapo-4-gigapixel-high-fidelity-v2-2x"
        },
        {
          "yaw": 3.0162372330222746,
          "pitch": 0.06286914450518566,
          "rotation": 0,
          "target": "0-1-basis"
        }
      ],
      "infoHotspots": []
    }
  ],
  "name": "Project Title",
  "settings": {
    "mouseViewMode": "drag",
    "autorotateEnabled": false,
    "fullscreenButton": false,
    "viewControlButtons": false
  }
};
